{"id": "7.2.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.1 正当必要性评估", "content": "7.2.1.a 评估团队应查验数据处理活动所涉及的业务说明、需求分析、合同协议、监管文件等能反映数据处理目的的相关文件，评估分析数据处理目的是否合理、正当，所涉及的数据数量、类型、频率是否为实现该目的下的最小范围。", "method": "测试需求| 1. 数据处理活动相关业务说明、需求分析、合同协议、监管文件。 | | 执行步骤 | 1. 查验并核对数据处理活动的相关文件，确认数据处理目的的合理性、正当性。 2. 分析数据处理所涉及的数据数量、类型、频率，评估是否为实现该目的下的最小范围。 | | 预期结果 | 1. 数据处理目的合理、正当。 2. 数据处理所涉及的数据数量、类型、频率为实现该目的下的最小范围。 "}
{"id": "7.2.2.1.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.1 组织保障/7.2.2.1.1 一般数据处理活动", "content": "7.2.2.1.1.a 查验数据处理者数据安全岗位人员名单，是否根据需要配备一定数量的数据安全管理人员，岗位人员名单是否包括部门名称、姓名、联系方式和工作职责等。", "method": "测试需求| 1. 数据处理者数据安全岗位人员名单。 | | 执行步骤 | 1. 核查数据安全岗位人员名单，确认是否配备足够的数据安全管理人员。 2. 确认名单中是否包含部门名称、姓名、联系方式和工作职责等信息。 | | 预期结果 | 1. 已配备一定数量的数据安全管理人员。 2. 岗位人员名单信息完整。 "}
{"id": "7.2.2.1.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.1 组织保障/7.2.2.1.1 一般数据处理活动", "content": "7.2.2.1.1.b 查验数据处理者数据安全管理制度文档，是否明确数据安全基础性管理和数据全生命周期各环节安全保护要求和操作规程；能覆盖数据分类分级、权限管理、日志留存、风险监测预警、应急响应、安全评估、教育培训等方面，并针对不同级别数据，明确数据生命周期各环节具体分级保护要求和操作规程；是否建立数据安全管理制度执行落实情况监督检查和考核问责制度，对数据处理活动进行安全监督管理，并协助电信主管部门开展工作。", "method": "测试需求| 1. 数据处理者数据安全管理制度文档。 2. 数据安全管理制度执行落实情况监督检查和考核问责制度。 | | 执行步骤 | 1. 查阅数据安全管理制度文档，确认是否明确数据安全基础性管理和全生命周期各环节安全保护要求及操作规程。 2. 确认制度内容是否覆盖数据分类分级、权限管理、日志留存、风险监测预警、应急响应、安全评估、教育培训等方面。 3. 确认是否针对不同级别数据明确分级保护要求和操作规程。 4. 查阅监督检查和考核问责制度，确认是否建立并落实。 | | 预期结果 | 1. 数据安全管理制度文档完善，覆盖全面。 2. 针对不同级别数据有明确的分级保护要求和操作规程。 3. 已建立并落实数据安全管理制度执行落实情况监督检查和考核问责制度。 "}
{"id": "7.2.2.1.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.1 组织保障/7.2.2.1.2 重要数据和核心数据处理活动", "content": "7.2.2.1.2.a 查验数据处理者数据安全管理体系与制度文档是否完备：1) 是否建立完整的数据处理者数据安全工作体系，工作体系是否能覆盖涉及数据安全保护和数据处理活动的相关部门，联合各相关部门开展数据安全保护工作，明确各相关部门的责任与分工；2) 是否明确数据安全管理机构，负责提出数据安全重大决策建议，定期组织召开数据安全相关工作会议，建立数据安全管理机构与相关部门的协作机制；3) 是否在数据安全管理责任部门至少配备一名数据安全专职人员，相关执行部门至少配备一名数据安全责任人，负责组织开展部门内数据安全相关工作。", "method": "测试需求| 1. 数据处理者数据安全管理体系与制度文档。 2. 数据安全管理机构会议纪要。 3. 数据安全专职人员和责任人名单。 | | 执行步骤 | 1. 查验数据安全管理体系与制度文档，确认其完整性，并核实是否覆盖所有相关部门。 2. 确认是否明确数据安全管理机构，并查阅会议纪要，确认其职能和协作机制。 3. 核查人员名单，确认数据安全管理责任部门和执行部门是否按要求配备专职人员和责任人。 | | 预期结果 | 1. 数据安全管理体系与制度文档完备且覆盖全面。 2. 已明确数据安全管理机构并建立协作机制。 3. 已按要求配备数据安全专职人员和责任人。 "}
{"id": "7.2.2.1.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.1 组织保障/7.2.2.1.2 重要数据和核心数据处理活动", "content": "7.2.2.1.2.b 查验数据处理者数据处理关键岗位职责说明文件或人员任命书内容是否完备：1) 是否指定数据处理者法定代表人或者主要负责人为数据安全第一责任人，领导团队中分管数据安全的成员为直接责任人；相关岗位人员情况是否登记入册；2) 相关岗位人员是否签署数据安全责任书或保密协议，内容包括但不限于岗位职责、相关义务、处罚措施、注意事项等。", "method": "测试需求| 1. 数据处理关键岗位职责说明文件或人员任命书。 2. 岗位人员登记入册记录。 3. 数据安全责任书或保密协议。 | | 执行步骤 | 1. 查验职责说明文件或任命书，确认是否指定数据安全第一责任人和直接责任人，并核实相关人员是否登记入册。 2. 核查是否签署数据安全责任书或保密协议，并审查其内容是否包含岗位职责、相关义务、处罚措施、注意事项等。 | | 预期结果 | 1. 已指定数据安全第一责任人和直接责任人，并登记入册。 2. 相关岗位人员已签署数据安全责任书或保密协议，内容完备。 "}
{"id": "7.2.2.2.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.2 数据分类分级/7.2.2.2.1 一般数据处理活动", "content": "7.2.2.2.1.a 查验数据处理者数据分类分级管理制度，是否明确数据分类分级管理范围、数据分类分级原则、标准及变更流程等内容；是否综合考虑业务需求、数据来源和用途等因素，划分本单位数据类别；是否在数据分类的基础上，按照电信主管部门要求以及相关标准规范制定数据分级标准识别重要数据和核心数据，明确各级数据界限，包括具体类别、子类、范围、对应的数据等，是否针对不同级别的数据制定差异化的保护策略。", "method": "测试需求| 1. 数据处理者数据分类分级管理制度。 | | 执行步骤 | 1. 查验数据分类分级管理制度，确认是否明确管理范围、原则、标准及变更流程。 2. 确认是否综合考虑业务需求、数据来源和用途等因素划分数据类别。 3. 核实是否按照电信主管部门要求及相关标准规范制定数据分级标准，识别重要数据和核心数据，并明确各级数据界限。 4. 确认是否针对不同级别数据制定差异化的保护策略。 | | 预期结果 | 1. 数据分类分级管理制度完善，分类分级标准明确。 2. 已针对不同级别数据制定差异化保护策略。 "}
{"id": "7.2.2.2.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.2 数据分类分级/7.2.2.2.1 一般数据处理活动", "content": "7.2.2.2.1.b 查验数据处理者数据资产梳理相关制度文件，是否明确数据资产的安全管理目标和原则，是否明确数据资产的维护和使用责任，是否明确数据资产梳理手段方式，是否明确定期系统梳理电子化数据与非电子化数据要求，是否明确数据存储情况梳理原则和梳理周期。", "method": "测试需求| 1. 数据处理者数据资产梳理相关制度文件。 | | 执行步骤 | 1. 查验数据资产梳理相关制度文件，确认是否明确数据资产的安全管理目标、原则、维护和使用责任。 2. 确认是否明确数据资产梳理手段、方式、定期梳理要求、存储情况梳理原则和周期。 | | 预期结果 | 1. 数据资产梳理相关制度文件完善，内容明确。 "}
{"id": "7.2.2.2.1.c", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.2 数据分类分级/7.2.2.2.1 一般数据处理活动", "content": "7.2.2.2.1.c 查验数据处理者数据资产梳理记录、数据资产清单等有关文件是否完备：1) 是否使用人工核对、自动化识别等方式，定期梳理本单位电子化数据与非电子化数据，并留存梳理记录；2) 是否覆盖数据处理者全范围，涵盖电子化数据与非电子化数据，全面掌握数据处理者数据资产分布、迁移、资产异常等情况；3) 是否按照电子化数据与非电子化数据两类分别形成数据资产清单，并根据规范要求对已形成的数据资产清单进行定期更新，形成资产变更记录；4) 是否针对数据规模大、挖掘价值高的一般数据实施动态管理，及时调整数据分级结果。", "method": "测试需求| 1. 数据处理者数据资产梳理记录。 2. 数据资产清单。 3. 资产变更记录。 | | 执行步骤 | 1. 查验数据资产梳理记录，确认是否定期梳理电子化和非电子化数据，并留存记录。 2. 确认梳理范围是否覆盖数据处理者全范围，并全面掌握数据资产情况。 3. 查验数据资产清单，确认是否按要求形成并定期更新，并核实资产变更记录。 4. 确认是否对一般数据实施动态管理，及时调整分级结果。 | | 预期结果 | 1. 数据资产梳理记录、数据资产清单等文件完备，并定期更新。 2. 已对一般数据实施动态管理。 "}
{"id": "7.2.2.2.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.2 数据分类分级/7.2.2.2.2 重要数据和核心数据处理活动", "content": "7.2.2.2.2.a 查验数据处理者数据安全管理相关制度文件，是否明确重要数据和核心数据目录和目录备案管理要求。", "method": "测试需求| 1. 数据处理者数据安全管理相关制度文件。 | | 执行步骤 | 1. 查验数据安全管理相关制度文件，确认是否明确重要数据和核心数据目录以及目录备案管理要求。 | | 预期结果 | 1. 制度文件明确重要数据和核心数据目录和目录备案管理要求。 "}
{"id": "7.2.2.2.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.2 数据分类分级/7.2.2.2.2 重要数据和核心数据处理活动", "content": "7.2.2.2.2.b 查验数据处理者是否按照相关法律法规、标准规范要求形成重要数据和核心数据目录。", "method": "测试需求| 1. 数据处理者重要数据和核心数据目录。 | | 执行步骤 | 1. 查验重要数据和核心数据目录，确认是否按照相关法律法规、标准规范要求形成。 | | 预期结果 | 1. 已按照要求形成重要数据和核心数据目录。 "}
{"id": "7.2.2.2.2.c", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.2 数据分类分级/7.2.2.2.2 重要数据和核心数据处理活动", "content": "7.2.2.2.2.c 查验数据处理者备案登记记录，是否按照有关规定开展目录备案和备案变更工作，是否在备案内容发生重大变化时，在发生变化的三个月内履行备案变更手续。", "method": "测试需求| 1. 数据处理者备案登记记录。 | | 执行步骤 | 1. 查验备案登记记录，确认是否按照规定开展目录备案和备案变更工作。 2. 确认备案内容发生重大变化时，是否在三个月内履行备案变更手续。 | | 预期结果 | 1. 已按规定开展目录备案和备案变更工作。 "}
{"id": "7.2.2.3.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.3 权限管理/7.2.2.3.1 一般数据处理活动", "content": "7.2.2.3.1.a 查验数据处理者数据访问权限管理制度，是否明确各部门和相关人员权限管理要求，是否建立数据内部登记、审批等工作机制，包括但不限于账号权限分配、开通、使用、变更、注销等审批流程和操作要求，重点关注账号权限变更、沉默账号、离职人员账号回收等情况。", "method": "测试需求| 1. 数据处理者数据访问权限管理制度。 | | 执行步骤 | 1. 查验数据访问权限管理制度，确认是否明确权限管理要求和内部登记、审批等工作机制。 2. 确认审批流程和操作要求是否覆盖账号权限分配、开通、使用、变更、注销等。 3. 重点关注账号权限变更、沉默账号、离职人员账号回收等情况。 | | 预期结果 | 1. 数据访问权限管理制度完善，审批流程和操作要求明确。 "}
{"id": "7.2.2.3.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.3 权限管理/7.2.2.3.1 一般数据处理活动", "content": "7.2.2.3.1.b 通过数据处理者演示账号生命周期管理流程，验证针对开发、测试、运维及运营人员等在创建和注销系统账号时，是否严格遵循系统账号创建和注销申请审批流程，并记录审批过程和结果；查验数据处理者涉及授权特定人员超权限处理数据的，是否采取多人审批授权或操作监督，是否留存审批并记录。", "method": "测试需求| 1. 账号生命周期管理流程演示。 2. 系统账号创建和注销申请审批记录。 3. 超权限处理数据审批和操作监督记录。 | | 执行步骤 | 1. 观察数据处理者演示账号生命周期管理流程，确认是否严格遵循系统账号创建和注销申请审批流程。 2. 查阅审批记录，确认是否留存审批过程和结果。 3. 查验涉及超权限处理数据的审批和操作监督记录。 | | 预期结果 | 1. 账号生命周期管理流程规范，审批记录完整。 2. 超权限处理数据采取多人审批授权或操作监督，并留存记录。 "}
{"id": "7.2.2.3.1.c", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.3 权限管理/7.2.2.3.1 一般数据处理活动", "content": "7.2.2.3.1.c 查验数据处理者是否建立并定期更新数据处理相关系统权限分配表，是否对能够处理相关数据的业务系统账号进行定期梳理；按照业务需求、安全策略、权责明确原则和最小授权原则等，合理界定本数据处理者的数据访问和处理权限，按照角色或用户组进行授权；是否对数据处理、数据安全管理、日志审计等岗位角色进行分离设置，是否严格控制超级管理员角色账号数量。", "method": "测试需求| 1. 数据处理相关系统权限分配表。 2. 业务系统账号梳理记录。 | | 执行步骤 | 1. 查验数据处理相关系统权限分配表，确认是否建立并定期更新。 2. 查阅业务系统账号梳理记录，确认是否定期梳理。 3. 评估数据访问和处理权限界定是否合理，授权是否按角色或用户组进行。 4. 确认是否对数据处理、数据安全管理、日志审计等岗位角色进行分离设置，并严格控制超级管理员账号数量。 | | 预期结果 | 1. 权限分配表建立并定期更新，权限界定合理，授权规范。 2. 岗位角色分离设置，超级管理员账号数量严格控制。 "}
{"id": "7.2.2.3.1.d", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.3 权限管理/7.2.2.3.1 一般数据处理活动", "content": "7.2.2.3.1.d 查验数据处理活动有关平台系统，是否对涉及数据高风险操作的（如批量复制、批量传输、批量销毁等操作)，采取多人审批授权或操作监督。", "method": "测试需求| 1. 数据处理活动有关平台系统。 2. 高风险操作审批授权或操作监督记录。 | | 执行步骤 | 1. 查验数据处理活动有关平台系统，确认是否对高风险操作采取多人审批授权或操作监督。 2. 查阅相关记录，确认审批授权或操作监督的执行情况。 | | 预期结果 | 1. 高风险操作采取多人审批授权或操作监督。 "}
{"id": "7.2.2.3.1.e", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.3 权限管理/7.2.2.3.1 一般数据处理活动", "content": "7.2.2.3.1.e 通过技术验证数据处理活动有关平台系统是否配备账号安全管理措施，避免非授权账号访问处理数据：1) 是否配置口令复杂度策略，如：口令长度不少于8位，使用大写字母、小写字母、数字及特殊字符中至少三种的组合，且与用户名、字符顺序无相关性；2) 是否配置账号锁定策略，对系统账号口令输入尝试次数进行限制；3) 是否对口令遗忘的申请和重置流程实施严格管理。", "method": "测试需求| 1. 数据处理活动有关平台系统。 | | 执行步骤 | 1. 技术验证平台系统是否配置口令复杂度策略。 2. 技术验证平台系统是否配置账号锁定策略。 3. 演示口令遗忘的申请和重置流程，确认是否实施严格管理。 | | 预期结果 | 1. 平台系统配备账号安全管理措施，口令复杂度、账号锁定策略配置有效。 2. 口令遗忘的申请和重置流程管理严格。 "}
{"id": "7.2.2.3.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.3 权限管理/7.2.2.3.2 重要数据和核心数据处理活动", "content": "7.2.2.3.2.a 查验数据处理者数据访问权限管理制度、规程、记录，是否明确重要数据和核心数据处理权限审批和记录管理要求，是否严格控制权限范围；针对非电子化数据，是否实施单次授权，对数据处理、携带方式和区域范围等进行限定。", "method": "测试需求| 1. 数据处理者数据访问权限管理制度、规程、记录。 | | 执行步骤 | 1. 查验权限管理制度、规程、记录，确认是否明确重要数据和核心数据处理权限审批和记录管理要求。 2. 确认是否严格控制权限范围，并针对非电子化数据实施单次授权，限定处理、携带方式和区域范围。 | | 预期结果 | 1. 权限管理制度、规程、记录完善，重要数据和核心数据处理权限审批和记录管理要求明确。 2. 权限范围严格控制，非电子化数据实施单次授权并限定范围。 "}
{"id": "7.2.2.3.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.3 权限管理/7.2.2.3.2 重要数据和核心数据处理活动", "content": "7.2.2.3.2.b 演示权限管理系统配置策略，是否精细化配置数据访问处理权限，访问主体精确到用户、访问对象精确到文件或数据库表；是否设置账号最大使用期限。", "method": "测试需求| 1. 权限管理系统演示。 | | 执行步骤 | 1. 观察权限管理系统配置策略演示，确认是否精细化配置数据访问处理权限，精确到用户、文件或数据库表。 2. 确认是否设置账号最大使用期限。 | | 预期结果 | 1. 权限管理系统精细化配置数据访问处理权限。 2. 已设置账号最大使用期限。 "}
{"id": "7.2.2.3.2.c", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.3 权限管理/7.2.2.3.2 重要数据和核心数据处理活动", "content": "7.2.2.3.2.c 技术验证重要数据和核心数据处理活动有关平台系统权限管理技术措施是否完备：1) 是否通过基于IP、MAC地址、服务路径等方式对所有接入重要数据和核心数据处理活动平台系统的用户或业务进行身份认证和权限控制；2) 是否限制非正常登录次数，非正常登录场景包括但不限于异常时间登录行为、短时间内在不同IP地址段登录行为、非正常工作区域登陆等；3) 是否配置会话失效策略，在登录后长时间无操作状态下可自动退出；4) 是否对登陆的验证信息（例如口令鉴别信息）采取保护措施（如口令加密、时间戳等方式），防止重放性攻击，防止非授权的数据访问；5) 是否存在可绕过账号登陆的安全漏洞（例如远程代码执行漏洞）或者越权漏洞。", "method": "测试需求| 1. 重要数据和核心数据处理活动有关平台系统。 | | 执行步骤 | 1. 技术验证是否通过IP、MAC地址、服务路径等方式进行身份认证和权限控制。 2. 技术验证是否限制非正常登录次数，包括异常时间、不同IP地址段、非正常工作区域登录。 3. 技术验证是否配置会话失效策略。 4. 技术验证是否对登录验证信息采取保护措施，防止重放性攻击和非授权访问。 5. 对系统进行安全漏洞扫描，验证是否存在可绕过账号登录的安全漏洞或越权漏洞。 | | 预期结果 | 1. 平台系统权限管理技术措施完备有效。 2. 不存在可绕过账号登录的安全漏洞或越权漏洞。 "}
{"id": "7.2.2.4.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.4 日志留存/7.2.2.4.1 一般数据处理活动", "content": "7.2.2.4.1.a 查验数据处理者日志管理相关制度文件，是否明确日志管理要求，包括日志记录范围、留存时间、日志备份要求、日志审计职责划分、人员配备与审计频度等内容。", "method": "测试需求| 1. 数据处理者日志管理相关制度文件。 | | 执行步骤 | 1. 查验日志管理相关制度文件，确认是否明确日志管理要求，包括记录范围、留存时间、备份要求、审计职责划分、人员配备与审计频度等内容。 | | 预期结果 | 1. 日志管理相关制度文件完善，内容明确。 "}
{"id": "7.2.2.4.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.4 日志留存/7.2.2.4.1 一般数据处理活动", "content": "7.2.2.4.1.b 查验数据处理者数据处理日志及系统运行日志记录，是否包括执行时间、操作账号、处理方式、授权情况、操作对象等，日志记录保存时间是否不少于6个月。", "method": "测试需求| 1. 数据处理日志。 2. 系统运行日志。 | | 执行步骤 | 1. 查阅数据处理日志及系统运行日志记录，确认是否包含执行时间、操作账号、处理方式、授权情况、操作对象等信息。 2. 核查日志记录保存时间，确认是否不少于6个月。 | | 预期结果 | 1. 日志记录信息完整。 2. 日志保存时间符合要求。 "}
{"id": "7.2.2.4.1.c", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.4 日志留存/7.2.2.4.1 一般数据处理活动", "content": "7.2.2.4.1.c 查验数据处理者体制审计相关制度，是否结合数据处理场景明确审计策略，包括审计目的、审计对象、审计内容、审计操作规程、审计频度、审计结果、审计问题整改跟踪等。", "method": "测试需求| 1. 数据处理者体制审计相关制度。 | | 执行步骤 | 1. 查验体制审计相关制度，确认是否结合数据处理场景明确审计策略，并包含审计目的、对象、内容、操作规程、频度、结果、问题整改跟踪等。 | | 预期结果 | 1. 体制审计制度完善，审计策略明确。 "}
{"id": "7.2.2.4.1.d", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.4 日志留存/7.2.2.4.1 一般数据处理活动", "content": "7.2.2.4.1.d 查验数据处理者日志审计报告，是否定期开展日志审计，形成审计报告，报告是否包含操作时间、操作主体、操作类型、操作对象、操作结果、审计问题、改进方案、异常情况处置记录等内容；是否对审计发现问题进行整改跟踪。", "method": "测试需求| 1. 数据处理者日志审计报告。 | | 执行步骤 | 1. 查阅日志审计报告，确认是否定期开展日志审计，并确认报告内容是否包含操作时间、操作主体、操作类型、操作对象、操作结果、审计问题、改进方案、异常情况处置记录等。 2. 确认是否对审计发现问题进行整改跟踪。 | | 预期结果 | 1. 定期开展日志审计并形成审计报告，报告内容完整。 2. 已对审计发现问题进行整改跟踪。 "}
{"id": "7.2.2.4.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.4 日志留存/7.2.2.4.2 重要数据和核心数据处理活动", "content": "7.2.2.4.2.a 演示日志审计平台主要功能、配置策略等，是否具备日志审计技术能力，是否将本数据处理者重要数据和核心数据处理活动全量纳入审计范围。", "method": "测试需求| 1. 日志审计平台演示。 | | 执行步骤 | 1. 观察日志审计平台主要功能和配置策略演示，确认是否具备日志审计技术能力。 2. 确认是否将重要数据和核心数据处理活动全量纳入审计范围。 | | 预期结果 | 1. 日志审计平台具备日志审计技术能力，并全量审计重要数据和核心数据处理活动。 "}
{"id": "7.2.2.4.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.4 日志留存/7.2.2.4.2 重要数据和核心数据处理活动", "content": "7.2.2.4.2.b 查验日志留存操作规范、日志记录等，是否对高风险操作的（如批量复制、批量传输、批量销毁等操作)日志进行备份，日志记录是否包含操作时间、操作账号、处理方式、授权情况、操作对象、数据量级具体操作语句等内容。是否对日志的备份文件定期进行完整性校验，以保证日志备份文件的可用性和真实性。", "method": "测试需求| 1. 日志留存操作规范。 2. 日志记录。 3. 日志备份文件完整性校验记录。 | | 执行步骤 | 1. 查验日志留存操作规范和日志记录，确认是否对高风险操作日志进行备份。 2. 确认日志记录是否包含操作时间、操作账号、处理方式、授权情况、操作对象、数据量级具体操作语句等内容。 3. 查验日志备份文件完整性校验记录，确认是否定期进行校验。 | | 预期结果 | 1. 高风险操作日志已备份，日志记录内容完整。 2. 定期进行日志备份文件完整性校验。 "}
{"id": "7.2.2.4.2.c", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.4 日志留存/7.2.2.4.2 重要数据和核心数据处理活动", "content": "7.2.2.4.2.c 查验日志审计制度规范、审计报告等，是否每半年对重要数据处理活动进行审计并形成审计报告，每季度对核心数据处理操作进行审计并形成审计报告。", "method": "测试需求| 1. 日志审计制度规范。 2. 审计报告。 | | 执行步骤 | 1. 查验日志审计制度规范和审计报告，确认是否每半年对重要数据处理活动进行审计并形成审计报告。 2. 确认是否每季度对核心数据处理操作进行审计并形成审计报告。 | | 预期结果 | 1. 按时完成重要数据和核心数据处理活动的审计并形成报告。 "}
{"id": "7.2.2.5.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.5 风险监测预警", "content": "7.2.2.5.a 查验数据处理者数据安全风险监测预警相关制度文件，是否明确数据安全风险监测预警工作负责部门，是否明确风险监测预警目的、方式、内容、操作规程、频度等内容，是否定期开展风险监测预警工作。", "method": "测试需求| 1. 数据处理者数据安全风险监测预警相关制度文件。 | | 执行步骤 | 1. 查验数据安全风险监测预警相关制度文件，确认是否明确负责部门、目的、方式、内容、操作规程、频度。 2. 确认是否定期开展风险监测预警工作。 | | 预期结果 | 1. 风险监测预警制度文件完善，并定期开展风险监测预警工作。 "}
{"id": "7.2.2.5.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.5 风险监测预警", "content": "7.2.2.5.b 查验数据处理者数据安全风险监测预警方案，是否明确风险监测预警工作职责分工、实施流程、处置措施及总结通报等内容。其中，实施流程是否对数据资产、数据处理活动、网络与系统设备、数据处理账号、内外部数据流动等实施监测巡查，对异常流动等行为进行排查预警与处置，形成处置记录。", "method": "测试需求| 1. 数据处理者数据安全风险监测预警方案。 2. 风险处置记录。 | | 执行步骤 | 1. 查验数据安全风险监测预警方案，确认是否明确职责分工、实施流程、处置措施及总结通报。 2. 确认实施流程是否覆盖数据资产、数据处理活动、网络与系统设备、数据处理账号、内外部数据流动等，并对异常行为进行排查预警与处置，形成处置记录。 | | 预期结果 | 1. 风险监测预警方案完善，并对异常行为进行排查预警与处置，形成处置记录。 "}
{"id": "7.2.2.5.c", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.5 风险监测预警", "content": "7.2.2.5.c 查验数据安全风险上报记录，是否按照有关要求对可能造成较大及以上安全事件的风险向本地区行业监管部门报告。", "method": "测试需求| 1. 数据安全风险上报记录。 | | 执行步骤 | 1. 查验数据安全风险上报记录，确认是否按要求对可能造成较大及以上安全事件的风险向本地区行业监管部门报告。 | | 预期结果 | 1. 已按要求上报数据安全风险。 "}
{"id": "7.2.2.6.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.6 应急处置/7.2.2.6.1 一般数据处理活动", "content": "7.2.2.6.1.a 查验数据处理者数据安全事件应急预案，是否充分考虑数据处理者涉及的各类数据安全事件业务场景，包括但不限于数据泄露（丢失）、数据被篡改、数据被损毁、数据违规使用等，是否根据事件等级明确应急响应责任分工、工作流程、处置措施等。", "method": "测试需求| 1. 数据处理者数据安全事件应急预案。 | | 执行步骤 | 1. 查验数据安全事件应急预案，确认是否充分考虑各类数据安全事件业务场景，并根据事件等级明确应急响应责任分工、工作流程、处置措施等。 | | 预期结果 | 1. 应急预案完善，覆盖各类数据安全事件场景。 "}
{"id": "7.2.2.6.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.6 应急处置/7.2.2.6.1 一般数据处理活动", "content": "7.2.2.6.1.b 查验数据处理者数据安全应急演练工作记录，是否制定数据安全事件应急演练计划；是否针对数据泄露（丢失）、数据被篡改、数据被损毁、数据违规使用等典型场景，至少每年开展一次全部场景的演练，并做好演练记录；是否根据演练结果视情况优化本数据处理者数据安全保护措施，形成演练报告。", "method": "测试需求| 1. 数据处理者数据安全应急演练工作记录。 2. 演练报告。 | | 执行步骤 | 1. 查验应急演练工作记录，确认是否制定演练计划，并针对典型场景至少每年开展一次全部场景的演练，并做好记录。 2. 查阅演练报告，确认是否根据演练结果优化数据安全保护措施。 | | 预期结果 | 1. 已制定应急演练计划并定期开展演练，演练记录和报告完整。 2. 已根据演练结果优化数据安全保护措施。 "}
{"id": "7.2.2.6.1.c", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.6 应急处置/7.2.2.6.1 一般数据处理活动", "content": "7.2.2.6.1.c 查验数据处理者数据安全应急响应处置记录是否完备：1) 是否在发生数据安全事件后，按照应急预案及时开展应急处置，采取数据恢复、关闭违规人员账号、下线相关系统接口等处置手段或补救措施；2) 发生可能损害用户合法权益的数据安全事件，是否及时告知用户，并提供减轻危害措施；3) 是否在事件处置完成后立即开展事件调查、问题整改、责任追究，在规定时限内形成报告，每年向本地区行业监管部门报告数据安全事件处置情况（未发生数据安全事件的无需上报）。", "method": "测试需求| 1. 数据处理者数据安全应急响应处置记录。 2. 数据安全事件报告。 | | 执行步骤 | 1. 查验应急响应处置记录，确认是否在发生数据安全事件后及时处置，并采取相应措施。 2. 确认是否及时告知用户并提供减轻危害措施。 3. 确认是否在处置完成后开展事件调查、问题整改、责任追究，并按时形成报告和上报。 | | 预期结果 | 1. 应急响应处置记录完备，处置及时有效。 2. 已及时告知用户并提供减轻危害措施。 3. 已开展事件调查、问题整改、责任追究，并按时形成报告和上报。 "}
{"id": "7.2.2.6.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.6 应急处置/7.2.2.6.2 重要数据和核心数据处理活动", "content": "7.2.2.6.2.a 查验数据处理者数据安全应急响应处置记录，是否在发生重要数据和核心数据安全事件时，立即向本地区行业监管部门报告（未发生数据安全事件的无需上报）。", "method": "测试需求| 1. 数据处理者数据安全应急响应处置记录。 2. 重要数据和核心数据安全事件报告。 | | 执行步骤 | 1. 查验应急响应处置记录，确认是否在发生重要数据和核心数据安全事件时立即向本地区行业监管部门报告。 | | 预期结果 | 1. 发生重要数据和核心数据安全事件时已立即上报。 "}
{"id": "7.2.2.7.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.7 安全评估/7.2.2.7.1 一般数据处理活动", "content": "7.2.2.7.1.a 查验数据处理者数据安全风险评估报告或自查记录，内容是否完善：1) 是否包括数据处理者基本情况、评估团队基本情况、数据处理活动分析、合规性评估、安全风险分析、评估结论及应对措施等内容；2) 是否对评估工作中发现的问题进行分析并明确对应问题所关联的风险，是否具有明确的风险或问题处理处置计划及对应的改进措施。", "method": "测试需求| 1. 数据处理者数据安全风险评估报告或自查记录。 | | 执行步骤 | 1. 查验风险评估报告或自查记录，确认内容是否完善，包括基本情况、评估团队、数据处理活动分析、合规性评估、安全风险分析、评估结论及应对措施。 2. 确认是否对发现问题进行分析并明确关联风险，是否具有明确的处置计划及改进措施。 | | 预期结果 | 1. 风险评估报告或自查记录内容完善。 2. 对发现问题有明确的处置计划和改进措施。 "}
{"id": "7.2.2.7.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.7 安全评估/7.2.2.7.1 一般数据处理活动", "content": "7.2.2.7.1.b 查验数据处理者数据安全风险或问题跟踪记录，是否对评估或自查中发现的安全风险或问题进行实际整改或改进，是否对整改措施的有效性进行复核。", "method": "测试需求| 1. 数据处理者数据安全风险或问题跟踪记录。 | | 执行步骤 | 1. 查验风险或问题跟踪记录，确认是否对发现的安全风险或问题进行实际整改或改进。 2. 确认是否对整改措施的有效性进行复核。 | | 预期结果 | 1. 已对发现的安全风险或问题进行整改或改进，并复核有效性。 "}
{"id": "7.2.2.7.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.7 安全评估/7.2.2.7.2 重要数据和核心数据处理活动", "content": "7.2.2.7.2.a 查验数据处理者数据安全风险评估工作相关管理制度、操作规程、评估报告等，是否明确至少每年开展一次数据安全风险评估，评估范围是否覆盖全部重要数据和核心数据，以及一定比例的一般数据。", "method": "测试需求| 1. 数据处理者数据安全风险评估工作相关管理制度、操作规程、评估报告。 | | 执行步骤 | 1. 查验数据安全风险评估工作相关管理制度、操作规程、评估报告，确认是否明确至少每年开展一次风险评估。 2. 确认评估范围是否覆盖全部重要数据和核心数据，以及一定比例的一般数据。 | | 预期结果 | 1. 已明确每年开展风险评估，评估范围覆盖要求。 "}
{"id": "7.2.2.7.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.7 安全评估/7.2.2.7.2 重要数据和核心数据处理活动", "content": "7.2.2.7.2.b 查验数据处理者数据安全风险评估报送记录，是否在规定期限内向本地区行业监管部门报送风险评估报告。", "method": "测试需求| 1. 数据处理者数据安全风险评估报送记录。 | | 执行步骤 | 1. 查验数据安全风险评估报送记录，确认是否在规定期限内向本地区行业监管部门报送风险评估报告。 | | 预期结果 | 1. 已在规定期限内报送风险评估报告。 "}
{"id": "7.2.2.8.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.8 教育培训/7.2.2.8.1 一般数据处理活动", "content": "7.2.2.8.1.a 查验数据处理者数据安全岗位人员教育和培训计划，培训内容是否涵盖数据安全法律、行政法规、标准规范、数据处理者数据安全管理制度和工作要求、数据安全领域知识技能、数据安全保护意识等。", "method": "测试需求| 1. 数据处理者数据安全岗位人员教育和培训计划。 | | 执行步骤 | 1. 查验数据安全岗位人员教育和培训计划，确认培训内容是否涵盖数据安全法律、行政法规、标准规范、管理制度、知识技能、保护意识等。 | | 预期结果 | 1. 培训计划内容覆盖全面。 "}
{"id": "7.2.2.8.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.8 教育培训/7.2.2.8.1 一般数据处理活动", "content": "7.2.2.8.1.b 查验数据处理者数据安全岗位人员教育培训工作记录（如培训计划、通知、议程、课件、签到表、考核记录等），培训对象是否覆盖数据处理者数据安全岗位人员，年度培训时长是否不少于10学时，培训后是否组织对培训内容进行考核评定，并留存考核评定记录。", "method": "测试需求| 1. 数据处理者数据安全岗位人员教育培训工作记录（如培训计划、通知、议程、课件、签到表、考核记录等）。 | | 执行步骤 | 1. 查验教育培训工作记录，确认培训对象是否覆盖数据安全岗位人员。 2. 确认年度培训时长是否不少于10学时。 3. 确认培训后是否组织考核评定，并留存记录。 | | 预期结果 | 1. 培训对象覆盖全面，培训时长符合要求，并进行考核评定，记录完整。 "}
{"id": "7.2.2.8.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.2 基础性安全评估/7.2.2.8 教育培训/7.2.2.8.2 重要数据和核心数据处理活动", "content": "7.2.2.8.2.a 查验数据处理者重要数据和核心数据处理岗位人员教育和培训计划，是否针对重要数据和核心数据处理岗位定期开展全员教育和培训，培训内容是否额外包括重要数据和核心数据安全管理要求、安全操作规程等，年度培训时长是否不少于20学时。", "method": "测试需求| 1. 数据处理者重要数据和核心数据处理岗位人员教育和培训计划。 | | 执行步骤 | 1. 查验重要数据和核心数据处理岗位人员教育和培训计划，确认是否定期开展全员培训。 2. 确认培训内容是否额外包括重要数据和核心数据安全管理要求、安全操作规程等。 3. 确认年度培训时长是否不少于20学时。 | | 预期结果 | 1. 定期开展重要数据和核心数据处理岗位的全员培训，培训内容和时长符合要求。 "}
{"id": "7.2.3.1.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.1 数据收集/7.2.3.1.1 一般数据处理活动", "content": "7.2.3.1.1.a 查验数据处理者数据收集相关制度文件，管理要求是否完备：1) 是否明确应遵循合法、正当原则，结合本数据处理者产品或服务业务功能需要开展数据收集活动；2) 是否明确数据收集渠道、数据格式、收集流程和收集方式、存储期限，不得窃取或者以其他方式非法收集数据。", "method": "测试需求| 1. 数据处理者数据收集相关制度文件。 | | 执行步骤 | 1. 查验数据收集相关制度文件，确认是否明确合法、正当原则，并结合业务功能需要开展数据收集活动。 2. 确认是否明确数据收集渠道、格式、流程、方式、存储期限，并禁止非法收集。 | | 预期结果 | 1. 数据收集制度文件完善，明确合法、正当原则和收集要求。 "}
{"id": "7.2.3.1.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.1 数据收集/7.2.3.1.1 一般数据处理活动", "content": "7.2.3.1.1.b 查验数据处理者具体业务用户协议或隐私政策文件，是否明确个人信息收集的目的、用途和范围，是否按照公开透明原则，将收集规则以通俗易懂、简单明了的文字向用户明示并获得授权。", "method": "测试需求| 1. 数据处理者具体业务用户协议或隐私政策文件。 | | 执行步骤 | 1. 查验业务用户协议或隐私政策文件，确认是否明确个人信息收集的目的、用途和范围。 2. 确认是否以通俗易懂、简单明了的文字向用户明示收集规则并获得授权。 | | 预期结果 | 1. 用户协议或隐私政策明确个人信息收集目的、用途和范围，并以公开透明原则向用户明示并获得授权。 "}
{"id": "7.2.3.1.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.1 数据收集/7.2.3.1.2 重要数据和核心数据处理活动", "content": "7.2.3.1.2.a 查验数据获取协议、承诺书等，是否针对间接途径获取的重要数据和核心数据的活动，是否与数据提供方签署协议、承诺书等，明确数据合作范围、目的、方式，以及双方应承担的安全责任等。", "method": "测试需求| 1. 数据获取协议、承诺书。 | | 执行步骤 | 1. 查验数据获取协议、承诺书，确认是否针对间接途径获取的重要数据和核心数据签署协议。 2. 确认协议是否明确数据合作范围、目的、方式和双方安全责任。 | | 预期结果 | 1. 已签署数据获取协议，明确合作范围、目的、方式和安全责任。 "}
{"id": "7.2.3.1.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.1 数据收集/7.2.3.1.2 重要数据和核心数据处理活动", "content": "7.2.3.1.2.b 查验数据处理者数据收集相关系统配置策略，是否根据数据安全级别采取相应的安全措施（部署防火墙、入侵检测系统、入侵防御系统、白名单接入控制等）防止数据收集设备遭受网络攻击，确保采集过程中数据不被泄露。", "method": "测试需求| 1. 数据处理者数据收集相关系统配置策略。 | | 执行步骤 | 1. 查验数据收集相关系统配置策略，确认是否根据数据安全级别采取相应的安全措施（如防火墙、入侵检测、入侵防御、白名单接入控制等）。 | | 预期结果 | 1. 数据收集系统配置策略符合安全要求，采取相应安全措施。 "}
{"id": "7.2.3.1.2.c", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.1 数据收集/7.2.3.1.2 重要数据和核心数据处理活动", "content": "7.2.3.1.2.c 技术验证数据收集设备安全技术措施的有效性，技术能力是否完备：1) 是否采用口令鉴别、生物鉴别、图片验证码、短信验证码、证书鉴别等至少两种以上的方法对接入用户进行身份认证和访问控制；2) 是否配置口令复杂度策略，如口令长度不少于8位，使用大写字母、小写字母、数字及特殊字符中至少三种的组合，且与用户名、字符顺序无相关性；3) 是否配置账号锁定策略，对系统账号口令输入尝试次数进行限制；4) 是否对口令遗忘的申请和重置流程实施严格管理，口令重置流程是否存在业务逻辑设计缺陷，是否留存申请和重置记录。", "method": "测试需求| 1. 数据收集设备。 | | 执行步骤 | 1. 技术验证数据收集设备是否采用至少两种以上方法进行身份认证和访问控制。 2. 技术验证是否配置口令复杂度策略。 3. 技术验证是否配置账号锁定策略。 4. 演示口令遗忘的申请和重置流程，确认是否实施严格管理，是否存在业务逻辑设计缺陷，并查阅申请和重置记录。 | | 预期结果 | 1. 数据收集设备安全技术措施有效，身份认证和访问控制符合要求。 2. 口令复杂度、账号锁定策略配置有效。 3. 口令遗忘申请和重置流程管理严格，无业务逻辑设计缺陷，记录完整。 "}
{"id": "7.2.3.1.2.d", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.1 数据收集/7.2.3.1.2 重要数据和核心数据处理活动", "content": "7.2.3.1.2.d 查验数据收集记录，是否记录数据收集来源、时间、类型、数量、频度、流向等内容。", "method": "测试需求| 1. 数据收集记录。 | | 执行步骤 | 1. 查验数据收集记录，确认是否记录数据收集来源、时间、类型、数量、频度、流向等内容。 | | 预期结果 | 1. 数据收集记录内容完整。 "}
{"id": "7.2.3.2.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.2 数据存储/7.2.3.2.1 一般数据处理活动", "content": "7.2.3.2.1.a 查验数据处理者数据存储环节相关制度文件，内容是否完备：1) 是否结合数据分类分级策略和管理要求明确数据存储安全策略和操作规程，包括各类数据存储平台系统差异化的安全存储措施（如加密、访问控制等）、数据存储介质安全策略和管理规定等；2) 是否明确对数据存储系统账号权限管理、访问控制、日志留存等方面的安全要求。", "method": "测试需求| 1. 数据处理者数据存储环节相关制度文件。 | | 执行步骤 | 1. 查验数据存储环节相关制度文件，确认是否结合数据分类分级策略明确数据存储安全策略和操作规程。 2. 确认是否明确各类数据存储平台系统差异化的安全存储措施、数据存储介质安全策略和管理规定。 3. 确认是否明确数据存储系统账号权限管理、访问控制、日志留存等安全要求。 | | 预期结果 | 1. 数据存储环节制度文件完善，内容完备。 "}
{"id": "7.2.3.2.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.2 数据存储/7.2.3.2.1 一般数据处理活动", "content": "7.2.3.2.1.b 查验数据处理者与数据存储系统管理和运维人员签订的保密协议或数据安全责任承诺书，是否明确数据使用范围、操作权限、违约责任等，有效约束相关人员行为。", "method": "测试需求| 1. 数据存储系统管理和运维人员签订的保密协议或数据安全责任承诺书。 | | 执行步骤 | 1. 查验保密协议或数据安全责任承诺书，确认是否明确数据使用范围、操作权限、违约责任等，并有效约束相关人员行为。 | | 预期结果 | 1. 已签订保密协议或数据安全责任承诺书，内容明确且有效约束相关人员行为。 "}
{"id": "7.2.3.2.1.c", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.2 数据存储/7.2.3.2.1 一般数据处理活动", "content": "7.2.3.2.1.c 查验数据存储系统核心功能、安全配置策略等，是否落实差异化的安全存储要求，是否配备对用户或业务（应用程序）的访问控制措施，避免非授权访问。", "method": "测试需求| 1. 数据存储系统。 | | 执行步骤 | 1. 查验数据存储系统核心功能、安全配置策略，确认是否落实差异化的安全存储要求。 2. 确认是否配备对用户或业务的访问控制措施，避免非授权访问。 | | 预期结果 | 1. 数据存储系统落实差异化安全存储要求，并配备访问控制措施，避免非授权访问。 "}
{"id": "7.2.3.2.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.2 数据存储/7.2.3.2.2 重要数据和核心数据处理活动", "content": "7.2.3.2.2.a 查验数据处理者重要数据和核心数据备份恢复相关管理制度，是否制定重要数据和核心数据容灾备份的规范和操作规程，明确规定数据容灾备份的周期、备份方式、备份地点等。", "method": "测试需求| 1. 数据处理者重要数据和核心数据备份恢复相关管理制度。 | | 执行步骤 | 1. 查验备份恢复管理制度，确认是否制定重要数据和核心数据容灾备份的规范和操作规程。 2. 确认是否明确规定数据容灾备份的周期、备份方式、备份地点等。 | | 预期结果 | 1. 已制定重要数据和核心数据容灾备份的规范和操作规程。 "}
{"id": "7.2.3.2.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.2 数据存储/7.2.3.2.2 重要数据和核心数据处理活动", "content": "7.2.3.2.2.b 查验数据存储系统安全配置策略，是否配备校验技术、密码技术等安全防护措施进行安全存储，是否提供重要数据和核心数据容灾备份的安全防护能力，是否定期开展数据恢复性测试，对备份数据的有效性和可用性进行检查和恢复验证。", "method": "测试需求| 1. 数据存储系统安全配置策略。 2. 数据恢复性测试记录。 | | 执行步骤 | 1. 查验数据存储系统安全配置策略，确认是否配备校验技术、密码技术等安全防护措施进行安全存储。 2. 确认是否提供重要数据和核心数据容灾备份的安全防护能力。 3. 查阅数据恢复性测试记录，确认是否定期开展测试，并检查备份数据的有效性和可用性。 | | 预期结果 | 1. 数据存储系统安全配置策略符合要求，具备容灾备份能力。 2. 定期开展数据恢复性测试。 "}
{"id": "7.2.3.2.2.c", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.2 数据存储/7.2.3.2.2 重要数据和核心数据处理活动", "content": "7.2.3.2.2.c 查验企业数据存储介质（含云存储形态与终端存储形态）管理制度，是否明确数据存储介质的获取、使用、维护、升级、标记和销毁等流程和审批记录要求，是否明确数据存储介质获取渠道、格式化规程、资产标识规程等要求。", "method": "测试需求| 1. 企业数据存储介质管理制度。 | | 执行步骤 | 1. 查验数据存储介质管理制度，确认是否明确介质的获取、使用、维护、升级、标记和销毁等流程和审批记录要求。 2. 确认是否明确数据存储介质获取渠道、格式化规程、资产标识规程等要求。 | | 预期结果 | 1. 数据存储介质管理制度完善，明确全生命周期管理要求。 "}
{"id": "7.2.3.3.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.3 数据使用加工/7.2.3.3.1 一般数据处理活动", "content": "7.2.3.3.1.a 查验数据处理者数据使用加工管理制度，相关要求是否完善：1) 是否符合国家相关法律法规对数据使用和分析处理的目的和范围的要求；2) 是否结合数据分级保护原则，明确数据使用安全策略和操作规程；3) 是否制定数据使用审批流程、数据使用结果发布、安全保护规则，以及相关人员岗位职责等。", "method": "测试需求| 1. 数据处理者数据使用加工管理制度。 | | 执行步骤 | 1. 查验数据使用加工管理制度，确认是否符合国家法律法规要求。 2. 确认是否结合数据分级保护原则，明确数据使用安全策略和操作规程。 3. 确认是否制定数据使用审批流程、结果发布、安全保护规则和人员职责等。 | | 预期结果 | 1. 数据使用加工管理制度完善，符合法律法规要求。 "}
{"id": "7.2.3.3.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.3 数据使用加工/7.2.3.3.1 一般数据处理活动", "content": "7.2.3.3.1.b 查验数据处理者数据导出规程、工作记录等，是否明确导出场景、导出范围，以及相应的审批规则，是否明确要求导出的数据类型及数量为当前处理活动场景所必需的最小数据集。", "method": "测试需求| 1. 数据处理者数据导出规程、工作记录。 | | 执行步骤 | 1. 查验数据导出规程和工作记录，确认是否明确导出场景、范围和审批规则。 2. 确认是否明确要求导出的数据类型及数量为当前处理活动场景所必需的最小数据集。 | | 预期结果 | 1. 数据导出规程明确，导出数据类型和数量符合最小数据集要求。 "}
{"id": "7.2.3.3.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.3 数据使用加工/7.2.3.3.2 重要数据和核心数据处理活动", "content": "7.2.3.3.2.a 查验数据处理者使用加工制度文件、操作规程、工作记录等，是否从账号身份管理原则、身份凭证保护、最小授权原则、数据权限默认设置、权限申请和审批等方面提出数据使用安全管控要求：1) 是否对数据安全管理人员、数据使用人员、日志审计人员的角色进行分离设置，为内部人员分配完成职责所需的最小数据使用权限；2) 涉及授权特定人员超权限处理数据的，是否由数据安全责任人进行审批并记录；3) 是否及时清除数据处理活动相关平台系统中测试账号、默认账号，杜绝多人共用同一系统账号的情况。", "method": "测试需求| 1. 数据处理者使用加工制度文件、操作规程、工作记录。 | | 执行步骤 | 1. 查验使用加工制度文件、操作规程、工作记录，确认是否从账号身份管理、身份凭证保护、最小授权、权限默认设置、权限申请和审批等方面提出安全管控要求。 2. 确认是否对相关角色进行分离设置，分配最小数据使用权限。 3. 确认是否由数据安全责任人审批并记录超权限处理数据。 4. 确认是否及时清除测试账号、默认账号，杜绝多人共用同一系统账号。 | | 预期结果 | 1. 数据使用加工制度完善，安全管控要求明确。 2. 角色分离设置，权限管理严格，无测试账号和默认账号。 "}
{"id": "7.2.3.3.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.3 数据使用加工/7.2.3.3.2 重要数据和核心数据处理活动", "content": "7.2.3.3.2.b 查验数据脱敏处理管理规范或制度文件，是否明确数据脱敏应用场景，以及相应的脱敏规则、方法、流程等：1) 是否明确在数据权限和资源申请阶段，首先开展数据脱敏需求评估，明确数据脱敏规则及方法；2) 是否建立数据脱敏处理技术应用安全评估机制，对脱敏后的数据可恢复性进行安全评估，是否对于可恢复形成原始数据的脱敏方法（含算法）进行安全加固；3) 是否使用脱敏的数据开展业务系统的开发测试。", "method": "测试需求| 1. 数据脱敏处理管理规范或制度文件。 | | 执行步骤 | 1. 查验数据脱敏处理管理规范或制度文件，确认是否明确脱敏应用场景、规则、方法、流程。 2. 确认是否在数据权限和资源申请阶段开展脱敏需求评估，明确规则和方法。 3. 确认是否建立脱敏处理技术应用安全评估机制，对可恢复数据进行安全加固。 4. 确认是否使用脱敏数据进行开发测试。 | | 预期结果 | 1. 数据脱敏管理规范完善，脱敏规则、方法、流程明确。 2. 已建立脱敏处理技术应用安全评估机制，并使用脱敏数据进行开发测试。 "}
{"id": "7.2.3.4.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.1 一般数据处理活动", "content": "7.2.3.4.1.a 查验数据处理者数据传输相关制度文件、操作规程，相关要求是否完善：1) 是否根据法律法规、业务需求、业务系统可用性、建设成本等要求，明确网络安全域划分策略，以及相应的数据安全防护策略；2) 是否结合数据分类分级策略和管理要求明确制定不同网络区域间数据传输安全保护规则，如访问控制、加密等。", "method": "测试需求| 1. 数据处理者数据传输相关制度文件、操作规程。 | | 执行步骤 | 1. 查验数据传输相关制度文件、操作规程，确认是否根据法律法规、业务需求等明确网络安全域划分策略和数据安全防护策略。 2. 确认是否结合数据分类分级策略制定不同网络区域间数据传输安全保护规则（如访问控制、加密）。 | | 预期结果 | 1. 数据传输制度文件、操作规程完善，明确网络安全域划分和数据安全防护策略。 "}
{"id": "7.2.3.4.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.1 一般数据处理活动", "content": "7.2.3.4.1.b 查验数据处理者数据传输的安全防护技术措施的落实情况，是否针对不同网络安全域之间的数据传输采取如监控、审计等安全防护技术措施。", "method": "测试需求| 1. 数据传输安全防护技术措施落实情况记录。 | | 执行步骤 | 1. 查验数据传输的安全防护技术措施落实情况，确认是否针对不同网络安全域之间的数据传输采取监控、审计等安全防护技术措施。 | | 预期结果 | 1. 数据传输采取监控、审计等安全防护技术措施。 "}
{"id": "7.2.3.4.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.2 重要数据和核心数据处理活动", "content": "7.2.3.4.2.a 查验数据处理者数据传输审批工作机制，是否对跨组织机构或使用互联网的重要数据和核心数据传输事项进行前置审批。", "method": "测试需求| 1. 数据处理者数据传输审批工作机制。 | | 执行步骤 | 1. 查验数据传输审批工作机制，确认是否对跨组织机构或使用互联网的重要数据和核心数据传输事项进行前置审批。 | | 预期结果 | 1. 对跨组织机构或使用互联网的重要数据和核心数据传输进行前置审批。 "}
{"id": "7.2.3.4.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.2 重要数据和核心数据处理活动", "content": "7.2.3.4.2.b 技术验证数据处理者在安全边界部署的安全管控技术措施，是否配备数据访问控制、身份认证措施，实现数据传输过程的审批管理：1) 是否有审批限制，审批通过后数据可传输，审批未通过不可传输；2) 是否留存审批的日志。", "method": "测试需求| 1. 数据处理者安全边界。 2. 数据传输审批日志。 | | 执行步骤 | 1. 技术验证安全边界部署的安全管控技术措施，确认是否配备数据访问控制、身份认证措施。 2. 确认是否实现数据传输过程的审批管理，即审批通过后可传输，未通过不可传输。 3. 查阅审批日志，确认是否留存。 | | 预期结果 | 1. 安全边界部署安全管控技术措施，实现数据传输审批管理。 2. 留存审批日志。 "}
{"id": "7.2.3.4.2.c", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.2 重要数据和核心数据处理活动", "content": "7.2.3.4.2.c 查验数据处理者数据加密相关制度文件或内部标准、技术措施等，是否依据传输数据级别，明确提出相匹配的数据加密要求（数据加密、数据签名、散列等）。", "method": "测试需求| 1. 数据处理者数据加密相关制度文件或内部标准、技术措施。 | | 执行步骤 | 1. 查验数据加密相关制度文件或内部标准、技术措施，确认是否依据传输数据级别提出匹配的数据加密要求（如数据加密、数据签名、散列）。 | | 预期结果 | 1. 数据加密要求明确，并根据数据级别匹配相应的技术措施。 "}
{"id": "7.2.3.4.2.d", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.2 重要数据和核心数据处理活动", "content": "7.2.3.4.2.d 技术验证数据传输安全措施的有效性，是否在传输重要数据时，采取校验技术、密码技术、安全传输通道或者安全传输协议等安全措施保证传输数据的安全性。", "method": "测试需求| 1. 数据传输过程。 | | 执行步骤 | 1. 技术验证数据传输安全措施的有效性，确认在传输重要数据时是否采取校验技术、密码技术、安全传输通道或安全传输协议等安全措施。 | | 预期结果 | 1. 传输重要数据时采取有效的安全措施。 "}
{"id": "7.2.3.4.2.e", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.2 重要数据和核心数据处理活动", "content": "7.2.3.4.2.e 查验数据处理者数据接口安全规范、操作规程等，相关要求是否完善：1) 是否明确规定使用数据接口的安全限制和安全控制措施等；2) 是否采取访问控制、签名等措施；针对跨安全域的数据接口，是否采用安全通道、传输加密、时间戳等措施。", "method": "测试需求| 1. 数据处理者数据接口安全规范、操作规程。 | | 执行步骤 | 1. 查验数据接口安全规范、操作规程，确认是否明确规定使用数据接口的安全限制和安全控制措施。 2. 确认是否采取访问控制、签名等措施，针对跨安全域接口是否采用安全通道、传输加密、时间戳等措施。 | | 预期结果 | 1. 数据接口安全规范完善，明确安全限制和控制措施。 "}
{"id": "7.2.3.4.2.f", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.2 重要数据和核心数据处理活动", "content": "7.2.3.4.2.f 查验数据处理者的安全接口清单，是否定期更新，包括接口名称、接口参数、对端业务系统、接口方式等相关内容。", "method": "测试需求| 1. 数据处理者安全接口清单。 | | 执行步骤 | 1. 查验安全接口清单，确认是否定期更新，并包含接口名称、接口参数、对端业务系统、接口方式等内容。 | | 预期结果 | 1. 安全接口清单定期更新，内容完整。 "}
{"id": "7.2.3.4.2.g", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.4 数据传输/7.2.3.4.2 重要数据和核心数据处理活动", "content": "7.2.3.4.2.g 查验数据处理者接口认证鉴权技术能力核心功能、配置策略等，是否能够通过MAC地址、IP地址或端口号绑定等方式限制非授权或违规设备接入，是否具备接口安全监测能力，能够发现非授权或违规设备、系统接入，并及时进行告警和处置。", "method": "测试需求| 1. 数据处理者接口认证鉴权技术能力核心功能、配置策略。 | | 执行步骤 | 1. 查验接口认证鉴权技术能力核心功能、配置策略，确认是否能够通过MAC地址、IP地址或端口号绑定等方式限制非授权或违规设备接入。 2. 确认是否具备接口安全监测能力，能够发现非授权或违规设备、系统接入，并及时进行告警和处置。 | | 预期结果 | 1. 接口认证鉴权技术能力具备，能够限制非授权接入并进行安全监测和处置。 "}
{"id": "7.2.3.5.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.5 数据提供/7.2.3.5.1 一般数据处理活动", "content": "7.2.3.5.1.a 查验数据处理者数据提供相关制度文件，是否区分数据提供场景，对应不同的数据提供场景建立相应的数据提供安全策略和操作规程，明确数据提供范围、类别、条件和程序。", "method": "测试需求| 1. 数据处理者数据提供相关制度文件。 | | 执行步骤 | 1. 查验数据提供相关制度文件，确认是否区分数据提供场景，并建立相应的安全策略和操作规程。 2. 确认是否明确数据提供范围、类别、条件和程序。 | | 预期结果 | 1. 数据提供制度文件完善，明确不同场景下的安全策略和操作规程。 "}
{"id": "7.2.3.5.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.5 数据提供/7.2.3.5.1 一般数据处理活动", "content": "7.2.3.5.1.b 查验数据处理者数据提供清单，是否包含获取方数据处理者名称、联系人信息，以及提供形式、期限、涉及的业务或系统、数据安全保护措施等内容，是否定期对清单进行更新。", "method": "测试需求| 1. 数据处理者数据提供清单。 | | 执行步骤 | 1. 查验数据提供清单，确认是否包含获取方数据处理者名称、联系人信息、提供形式、期限、涉及业务或系统、数据安全保护措施等内容。 2. 确认是否定期对清单进行更新。 | | 预期结果 | 1. 数据提供清单内容完整并定期更新。 "}
{"id": "7.2.3.5.1.c", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.5 数据提供/7.2.3.5.1 一般数据处理活动", "content": "7.2.3.5.1.c 查验数据处理者数据提供服务合同或协议，是否按照最小必要的原则规定数据获取方可接触到的数据范围、使用权限、用途等，是否明确数据获取方的数据安全保护责任。", "method": "测试需求| 1. 数据处理者数据提供服务合同或协议。 | | 执行步骤 | 1. 查验数据提供服务合同或协议，确认是否按照最小必要原则规定数据获取方可接触的数据范围、使用权限、用途等。 2. 确认是否明确数据获取方的数据安全保护责任。 | | 预期结果 | 1. 数据提供服务合同或协议明确数据获取方的数据范围、使用权限、用途和安全保护责任。 "}
{"id": "7.2.3.5.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.5 数据提供/7.2.3.5.2 重要数据和核心数据处理活动", "content": "7.2.3.5.2.a 查验数据处理者数据提供相关制度文件，是否明确对重要数据和核心数据获取方安全能力进行核验，并签署数据安全协议。", "method": "测试需求| 1. 数据处理者数据提供相关制度文件。 | | 执行步骤 | 1. 查验数据提供相关制度文件，确认是否明确对重要数据和核心数据获取方安全能力进行核验，并签署数据安全协议。 | | 预期结果 | 1. 数据提供制度文件明确对获取方进行安全核验并签署数据安全协议。 "}
{"id": "7.2.3.5.2.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.5 数据提供/7.2.3.5.2 重要数据和核心数据处理活动", "content": "7.2.3.5.2.b 查验数据处理者针对数据获取方的安全管理记录，是否对数据获取方的资质和数据安全保护能力进行核验，是否签署数据安全协议，明确双方数据安全保护责任。", "method": "测试需求| 1. 数据处理者针对数据获取方的安全管理记录。 | | 执行步骤 | 1. 查验针对数据获取方的安全管理记录，确认是否对数据获取方的资质和数据安全保护能力进行核验。 2. 确认是否签署数据安全协议，明确双方数据安全保护责任。 | | 预期结果 | 1. 已对数据获取方进行资质和安全能力核验，并签署数据安全协议，明确双方责任。 "}
{"id": "7.2.3.5.2.c", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.5 数据提供/7.2.3.5.2 重要数据和核心数据处理活动", "content": "7.2.3.5.2.c 查验重要数据和核心数据提供相关记录、操作规程等，是否对提供的重要数据和核心数据进行脱敏处理；对于无法脱敏的，是否采取校验技术、密码技术、安全传输通道、安全传输协议等安全保障措施；跨主体提供核心数据时，是否已评估安全风险，采取必要的安全保护措施，是否由本地区行业监管部门审查后报工业和信息化部。", "method": "测试需求| 1. 重要数据和核心数据提供相关记录、操作规程。 | | 执行步骤 | 1. 查验提供记录和操作规程，确认是否对提供的重要数据和核心数据进行脱敏处理。 2. 对于无法脱敏的数据，确认是否采取校验技术、密码技术、安全传输通道、安全传输协议等安全保障措施。 3. 确认跨主体提供核心数据时是否已评估安全风险，采取必要安全保护措施，并由本地区行业监管部门审查后报工业和信息化部。 | | 预期结果 | 1. 已对重要数据和核心数据进行脱敏处理或采取安全保障措施。 2. 跨主体提供核心数据时已评估风险、采取措施并按规定报送。 "}
{"id": "7.2.3.6.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.6 数据出境", "content": "7.2.3.6.a 查验数据处理者数据出境活动清单、数据出境安全评估报告等。是否按要求开展数据出境风险评估，评估结果是否在有效期内，评估内容是否包括数据出境的规模、范围、种类、敏感程度，以及数据出境活动可能对国家安全、公共利益、个人或者组织合法权益带来的风险等；是否向国家网信部门申报数据出境安全评估，并获得批准。", "method": "测试需求| 1. 数据处理者数据出境活动清单。 2. 数据出境安全评估报告。 3. 国家网信部门数据出境安全评估批准文件。 | | 执行步骤 | 1. 查验数据出境活动清单和安全评估报告，确认是否按要求开展风险评估，评估结果是否在有效期内。 2. 确认评估内容是否包括数据出境的规模、范围、种类、敏感程度以及可能带来的风险。 3. 查验批准文件，确认是否向国家网信部门申报数据出境安全评估并获得批准。 | | 预期结果 | 1. 已按要求开展数据出境风险评估，评估结果在有效期内。 2. 已向国家网信部门申报数据出境安全评估并获得批准。 "}
{"id": "7.2.3.6.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.6 数据出境", "content": "7.2.3.6.b 查验数据处理者与境外获取方订立的合同或者其他具有法律效力的文件，是否充分约定了数据安全保护责任义务、境外获取方承诺承担的责任义务、以及履行责任义务的管理和技术措施、能力等；是否建立通畅的个人信息权益维护渠道；是否采取加密等技术措施保障数据出境安全。", "method": "测试需求| 1. 数据处理者与境外获取方订立的合同或法律文件。 | | 执行步骤 | 1. 查验与境外获取方订立的合同或法律文件，确认是否充分约定数据安全保护责任义务、境外获取方承诺承担的责任义务、履行责任义务的管理和技术措施、能力等。 2. 确认是否建立通畅的个人信息权益维护渠道。 3. 确认是否采取加密等技术措施保障数据出境安全。 | | 预期结果 | 1. 与境外获取方订立的合同或法律文件约定明确。 2. 已建立通畅的个人信息权益维护渠道。 3. 已采取加密等技术措施保障数据出境安全。 "}
{"id": "7.2.3.7.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.7 数据公开/7.2.3.7.1 一般数据处理活动", "content": "7.2.3.7.1.a 查验数据处理者数据公开相关制度文件，是否明确数据公开范围、类别、条件和流程，明确可能对国家安全、公共利益产生影响的数据，不得公开，是否区分数据公开场景，对应不同的数据公开场景建立相应的数据公开安全策略和操作规程。", "method": "测试需求| 1. 数据处理者数据公开相关制度文件。 | | 执行步骤 | 1. 查验数据公开相关制度文件，确认是否明确数据公开范围、类别、条件和流程。 2. 确认是否明确不得公开可能影响国家安全、公共利益的数据。 3. 确认是否区分数据公开场景，并建立相应的安全策略和操作规程。 | | 预期结果 | 1. 数据公开制度文件完善，明确数据公开范围、类别、条件和流程，并区分场景建立安全策略。 "}
{"id": "7.2.3.7.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.7 数据公开/7.2.3.7.1 一般数据处理活动", "content": "7.2.3.7.1.b 查验数据处理者数据公开相关业务系统的审批记录，是否具有数据公开的审批流程，明确审批重点内容、审批记录留存要求，公开数据的具体内容是否仅满足业务场景需求且未超出授权范围。", "method": "测试需求| 1. 数据处理者数据公开相关业务系统的审批记录。 | | 执行步骤 | 1. 查验数据公开相关业务系统的审批记录，确认是否具有数据公开的审批流程，并明确审批重点内容和记录留存要求。 2. 确认公开数据的具体内容是否仅满足业务场景需求且未超出授权范围。 | | 预期结果 | 1. 数据公开审批流程规范，记录完整，公开内容符合要求。 "}
{"id": "7.2.3.7.1.c", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.7 数据公开/7.2.3.7.1 一般数据处理活动", "content": "7.2.3.7.1.c 查验数据处理者数据公开记录、风险评估报告等，是否在数据公开前开展数据安全风险评估。", "method": "测试需求| 1. 数据处理者数据公开记录、风险评估报告。 | | 执行步骤 | 1. 查验数据公开记录和风险评估报告，确认是否在数据公开前开展数据安全风险评估。 | | 预期结果 | 1. 已在数据公开前开展数据安全风险评估。 "}
{"id": "7.2.3.7.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.7 数据公开/7.2.3.7.2 重要数据和核心数据处理活动", "content": "7.2.3.7.2.a 查验数据处理者重要数据公开相关制度文件，相关要求是否完善：1) 是否区分重要数据公开场景，对应不同的数据公开场景建立相应的数据公开安全策略和操作规程，明确重要数据公开范围、内容与有效控制机制；2) 是否建立重要数据公开脱敏机制，明确对于法律、行政法规要求公开的数据场景（如网站、APP、业务登记单、显示屏幕等展示场景），应采用静态脱敏等措施防止发生敏感数据泄露和滥用。", "method": "测试需求| 1. 数据处理者重要数据公开相关制度文件。 | | 执行步骤 | 1. 查验重要数据公开相关制度文件，确认是否区分公开场景，并建立相应的安全策略和操作规程，明确公开范围、内容和控制机制。 2. 确认是否建立重要数据公开脱敏机制，并采用静态脱敏等措施防止敏感数据泄露和滥用。 | | 预期结果 | 1. 重要数据公开制度文件完善，并建立脱敏机制，防止敏感数据泄露和滥用。 "}
{"id": "7.2.3.8.1.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.8 数据销毁/7.2.3.8.1 一般数据处理活动", "content": "7.2.3.8.1.a 查验数据处理者数据销毁相关制度文件，是否结合数据分类分级管理制度和安全需求，建立数据销毁安全策略和操作规程，明确销毁对象、销毁原因（如在数据业务下线、用户退出服务、节点失效、过多备份、数据试用结束、数据超出保存期限等情况）和销毁流程、数据销毁技术处理策略等。", "method": "测试需求| 1. 数据处理者数据销毁相关制度文件。 | | 执行步骤 | 1. 查验数据销毁相关制度文件，确认是否结合数据分类分级管理制度和安全需求，建立数据销毁安全策略和操作规程。 2. 确认是否明确销毁对象、原因、流程和技术处理策略。 | | 预期结果 | 1. 数据销毁制度文件完善，明确销毁策略、流程和技术处理策略。 "}
{"id": "7.2.3.8.1.b", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.8 数据销毁/7.2.3.8.1 一般数据处理活动", "content": "7.2.3.8.1.b 查验数据销毁工具，是否对不同类型的存储介质（闪存、移动硬盘、固态硬盘、硬盘、磁带、光盘等），提供不同的销毁措施。如针对用户注销服务、存储介质维护需要带出机房等场景可采用多遍覆盖、删除密钥、执行固件擦除命令等安全数据删除方式，针对介质报废等场景，可采取高压击穿、消磁、粉碎等物理损毁手段；", "method": "测试需求| 1. 数据销毁工具。 | | 执行步骤 | 1. 查验数据销毁工具，确认是否对不同类型的存储介质提供不同的销毁措施。 2. 确认是否针对特定场景（如用户注销、介质带出、介质报废）采取相应的安全数据删除或物理损毁手段。 | | 预期结果 | 1. 数据销毁工具支持不同存储介质的销毁，并采取相应的销毁措施。 "}
{"id": "7.2.3.8.1.c", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.8 数据销毁/7.2.3.8.1 一般数据处理活动", "content": "7.2.3.8.1.c 查验数据处理者数据销毁工作记录，是否对销毁后所涉及的资源进行回收，包括账号、物理资源、云资源、系统存储空间、数据共享途径等，并对销毁过程进行记录。", "method": "测试需求| 1. 数据处理者数据销毁工作记录。 | | 执行步骤 | 1. 查验数据销毁工作记录，确认是否对销毁后所涉及的资源进行回收。 2. 确认是否对销毁过程进行记录。 | | 预期结果 | 1. 数据销毁工作记录完整，已回收相关资源。 "}
{"id": "7.2.3.8.2.a", "condition": "required", "heading": "7.2 合规性评估/7.2.3 数据全生命周期安全评估/7.2.3.8 数据销毁/7.2.3.8.2 重要数据和核心数据处理活动", "content": "7.2.3.8.2.a 查验数据处理者数据销毁相关制度文件，工作记录等，相关内容是否完备：1) 是否设置销毁相关监督角色，监督操作过程；2) 是否针对数据销毁建立完善的操作审批机制，采用多人操作模式，限制单人拥有完整操作权限；3) 是否明确重要数据和核心数据销毁后，不得以任何理由、任何方式进行恢复；引起备案内容发生变化的，是否履行备案变更手续。", "method": "测试需求| 1. 数据处理者数据销毁相关制度文件、工作记录。 | | 执行步骤 | 1. 查验数据销毁相关制度文件和工作记录，确认是否设置销毁监督角色，并监督操作过程。 2. 确认是否建立完善的操作审批机制，采用多人操作模式，限制单人完整操作权限。 3. 确认是否明确重要数据和核心数据销毁后不得恢复，并确认备案内容变化时是否履行备案变更手续。 | | 预期结果 | 1. 数据销毁制度完善，有监督角色和审批机制，限制单人操作权限。 2. 重要数据和核心数据销毁后不得恢复，并按规定履行备案变更手续。 "}
{"id": "7.3.1.1.a", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.a 处理数据的网络环境是否为内部网络。", "method": "测试需求| 1. 网络拓扑图。 2. 系统网络配置。 | | 执行步骤 | 1. 查阅网络拓扑图和系统网络配置，确认处理数据的网络环境是否为内部网络。 | | 预期结果 | 1. 处理数据的网络环境为内部网络。 "}
{"id": "7.3.1.1.b", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.b 处理数据的信息系统是否与其他系统隔离，是否与其他系统存在数据交互，交互方式是否为网络接口，否存在未鉴权、未认证接口，是否配备接口安全保障措施，如身份验证、流量监控、数据加密等。", "method": "测试需求| 1. 系统架构图。 2. 接口文档。 3. 接口安全配置。 | | 执行步骤 | 1. 查阅系统架构图，确认处理数据的信息系统是否与其他系统隔离。 2. 查阅接口文档，确认是否存在数据交互，交互方式是否为网络接口。 3. 检查接口安全配置，确认是否存在未鉴权、未认证接口，并确认是否配备身份验证、流量监控、数据加密等接口安全保障措施。 | | 预期结果 | 1. 信息系统与其他系统隔离或数据交互接口安全受控。 2. 不存在未鉴权、未认证接口，已配备接口安全保障措施。 "}
{"id": "7.3.1.1.c", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.c 数据处理过程中是否实施严格的访问控制、权限管理等。", "method": "测试需求| 1. 访问控制策略。 2. 权限管理制度。 3. 系统配置。 | | 执行步骤 | 1. 查阅访问控制策略和权限管理制度，确认是否实施严格的访问控制和权限管理。 2. 检查系统配置，验证访问控制和权限管理措施的有效性。 | | 预期结果 | 1. 已实施严格的访问控制和权限管理。 "}
{"id": "7.3.1.1.d", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.d 处理数据的信息系统边界是否部署安全防护设备，配置严格的安全防护策略，实现对网络攻击、入侵、木马病毒等的拦截防护。", "method": "测试需求| 1. 网络安全设备配置。 2. 安全防护策略文档。 | | 执行步骤 | 1. 查阅网络安全设备配置和安全防护策略文档，确认信息系统边界是否部署安全防护设备。 2. 检查安全防护策略配置，确认是否实现对网络攻击、入侵、木马病毒等的拦截防护。 | | 预期结果 | 1. 信息系统边界部署安全防护设备，并配置严格的安全防护策略。 "}
{"id": "7.3.1.1.e", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.e 是否监测和记录网络运行状态，是否标记、分析数据流转状态，及时发现数据异常流量和违规使用等情况。", "method": "测试需求| 1. 网络运行监控日志。 2. 数据流转分析报告。 3. 异常告警记录。 | | 执行步骤 | 1. 查阅网络运行监控日志和数据流转分析报告，确认是否监测和记录网络运行状态、标记和分析数据流转状态。 2. 查阅异常告警记录，确认是否及时发现数据异常流量和违规使用等情况。 | | 预期结果 | 1. 已监测和记录网络运行状态，并及时发现数据异常流量和违规使用情况。 "}
{"id": "7.3.1.1.f", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.f 是否配备数据防泄露技术能力，全面覆盖处理数据的系统和终端，实现对网络、蓝牙、USB、邮件等多渠道的数据泄露监测预警与拦截处置。", "method": "测试需求| 1. 数据防泄露系统配置。 2. 数据泄露告警与处置记录。 | | 执行步骤 | 1. 查阅数据防泄露系统配置，确认是否配备相关技术能力，并覆盖处理数据的系统和终端。 2. 查阅数据泄露告警与处置记录，确认是否实现对多渠道的数据泄露监测预警与拦截处置。 | | 预期结果 | 1. 已配备数据防泄露技术能力，并实现多渠道数据泄露的监测预警与拦截处置。 "}
{"id": "7.3.1.1.g", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.g 是否定期对处理数据的信息系统进行安全检查、评估、渗透测试等，并及时进行补丁更新和安全加固，是否有效防范信息系统漏洞。", "method": "测试需求| 1. 安全检查报告。 2. 安全评估报告。 3. 渗透测试报告。 4. 补丁更新和安全加固记录。 | | 执行步骤 | 1. 查阅安全检查、评估、渗透测试报告，确认是否定期进行。 2. 查阅补丁更新和安全加固记录，确认是否及时进行。 3. 评估是否有效防范信息系统漏洞。 | | 预期结果 | 1. 定期进行安全检查、评估、渗透测试，并及时进行补丁更新和安全加固，有效防范信息系统漏洞。 "}
{"id": "7.3.1.1.h", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.h 处理重要数据、核心数据的信息系统是否具备重要数据、核心数据识别能力，能够对重要数据、核心数据进行有效、准确的识别发现。", "method": "测试需求| 1. 重要数据、核心数据识别系统功能演示。 2. 识别结果报告。 | | 执行步骤 | 1. 演示重要数据、核心数据识别系统功能，确认是否具备识别能力。 2. 查阅识别结果报告，确认识别的有效性和准确性。 | | 预期结果 | 1. 信息系统具备重要数据、核心数据识别能力，并能有效、准确地识别发现。 "}
{"id": "7.3.1.1.i", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.i 是否采用加密传输、加密存储等方式保障重要数据、核心数据安全，加密方式是否安全有效。", "method": "测试需求| 1. 加密传输配置。 2. 加密存储配置。 3. 加密算法和密钥管理文档。 | | 执行步骤 | 1. 查阅加密传输和加密存储配置，确认是否采用加密方式保障重要数据、核心数据安全。 2. 查阅加密算法和密钥管理文档，评估加密方式是否安全有效。 | | 预期结果 | 1. 已采用安全有效的加密传输和加密存储方式保障重要数据、核心数据安全。 "}
{"id": "7.3.1.1.j", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.j 是否对存储数据的介质进行加强管理，根据数据级别设置相应的审批管理机制，针对重要数据和核心数据实施多级权限审批管理，禁止非相关人员接触，并严格留存使用记录。", "method": "测试需求| 1. 存储介质管理制度。 2. 审批管理记录。 3. 介质使用记录。 | | 执行步骤 | 1. 查阅存储介质管理制度，确认是否加强管理，并根据数据级别设置审批管理机制。 2. 查阅审批管理记录和介质使用记录，确认是否针对重要数据和核心数据实施多级权限审批管理，禁止非相关人员接触，并严格留存使用记录。 | | 预期结果 | 1. 已加强存储介质管理，并对重要数据和核心数据实施多级权限审批管理，记录完整。 "}
{"id": "7.3.1.1.k", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.k 是否对数据进行定期备份与恢复，备份方式是否安全可靠，是否实现重要数据和核心数据容灾备份，保障数据可用性。", "method": "测试需求| 1. 数据备份恢复策略。 2. 备份恢复记录。 3. 容灾备份方案。 | | 执行步骤 | 1. 查阅数据备份恢复策略和备份恢复记录，确认是否对数据进行定期备份与恢复，备份方式是否安全可靠。 2. 查阅容灾备份方案，确认是否实现重要数据和核心数据容灾备份，保障数据可用性。 | | 预期结果 | 1. 已对数据进行定期备份与恢复，备份方式安全可靠，并实现重要数据和核心数据容灾备份。 "}
{"id": "7.3.1.1.l", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.l 是否配备数据销毁技术手段，确保重要数据、核心数据销毁后的不可恢复。", "method": "测试需求| 1. 数据销毁技术方案。 2. 销毁记录。 | | 执行步骤 | 1. 查阅数据销毁技术方案，确认是否配备相关技术手段。 2. 查阅销毁记录，验证销毁后的数据是否不可恢复。 | | 预期结果 | 1. 已配备数据销毁技术手段，确保重要数据、核心数据销毁后的不可恢复。 "}
{"id": "7.3.1.1.m", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.1 网络环境和技术措施", "content": "7.3.1.1.m 是否制定数据日志审计策略，明确审计方法、内容、流程等要求，实现对重要数据、核心数据收集、存储、传输、使用、提供、公开、销毁等环节的实时审计，并对异常操作进行预警。", "method": "测试需求| 1. 数据日志审计策略。 2. 审计平台配置。 3. 异常操作预警记录。 | | 执行步骤 | 1. 查阅数据日志审计策略，确认是否明确审计方法、内容、流程等要求。 2. 查阅审计平台配置，确认是否实现对重要数据、核心数据全生命周期的实时审计。 3. 查阅异常操作预警记录，确认是否对异常操作进行预警。 | | 预期结果 | 1. 已制定数据日志审计策略，并实现对重要数据、核心数据全生命周期的实时审计和异常操作预警。 "}
{"id": "7.3.1.2.a", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.2 管理制度和处理流程", "content": "7.3.1.2.a 是否根据数据级别建立完备的数据管理制度，覆盖数据全生命周期，明确重要数据、核心数据目录备案，以及数据安全风险评估、权限管理、日志留存、风险监测预警、获取方管理、应急响应、教育培训等相关管理要求。", "method": "测试需求| 1. 数据管理制度文档。 | | 执行步骤 | 1. 查阅数据管理制度文档，确认是否根据数据级别建立完备的制度。 2. 确认制度内容是否覆盖数据全生命周期，并明确重要数据、核心数据目录备案、风险评估、权限管理、日志留存、风险监测预警、获取方管理、应急响应、教育培训等管理要求。 | | 预期结果 | 1. 已根据数据级别建立完备的数据管理制度，覆盖数据全生命周期。 "}
{"id": "7.3.1.2.b", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.2 管理制度和处理流程", "content": "7.3.1.2.b 是否对数据授权访问、批量复制、使用加工、出境、销毁等重点环节进行日志留存，留存时间是否不少于6个月，涉及出境环节日志记录是否按照国家有关规定留存。", "method": "测试需求| 1. 重点环节日志记录。 | | 执行步骤 | 1. 查阅重点环节日志记录，确认是否对数据授权访问、批量复制、使用加工、出境、销毁等环节进行日志留存。 2. 确认日志留存时间是否不少于6个月，涉及出境环节日志是否按照国家有关规定留存。 | | 示例结果 | 1. 重点环节日志留存完整，留存时间符合要求。 "}
{"id": "7.3.1.2.c", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.2 管理制度和处理流程", "content": "7.3.1.2.c 是否建立数据安全风险监测报送机制，及时发现、识别和报送数据安全风险。", "method": "测试需求| 1. 数据安全风险监测报送机制文档。 2. 风险报送记录。 | | 执行步骤 | 1. 查阅数据安全风险监测报送机制文档，确认是否建立。 2. 查阅风险报送记录，确认是否及时发现、识别和报送数据安全风险。 | | 预期结果 | 1. 已建立数据安全风险监测报送机制，并及时发现、识别和报送数据安全风险。 "}
{"id": "7.3.1.2.d", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.2 管理制度和处理流程", "content": "7.3.1.2.d 是否建立数据安全事件应急响应机制，制定应急预案和处置流程，定期开展应急演练。", "method": "测试需求| 1. 数据安全事件应急预案。 2. 应急处置流程。 3. 应急演练记录。 | | 执行步骤 | 1. 查阅数据安全事件应急预案和应急处置流程，确认是否建立。 2. 查阅应急演练记录，确认是否定期开展应急演练。 | | 预期结果 | 1. 已建立数据安全事件应急响应机制，制定应急预案和处置流程，并定期开展应急演练。 "}
{"id": "7.3.1.2.e", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.2 管理制度和处理流程", "content": "7.3.1.2.e 是否建立内部审批和登记等工作机制，对重要数据和核心数据处理活动进行严格管理并留存记录。", "method": "测试需求| 1. 内部审批和登记工作机制文档。 2. 重要数据和核心数据处理活动审批和登记记录。 | | 执行步骤 | 1. 查阅内部审批和登记工作机制文档，确认是否建立。 2. 查阅重要数据和核心数据处理活动审批和登记记录，确认是否严格管理并留存记录。 | | 预期结果 | 1. 已建立内部审批和登记工作机制，对重要数据和核心数据处理活动进行严格管理并留存记录。 "}
{"id": "7.3.1.3.a", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.3 参与人员和获取方管理", "content": "7.3.1.3.a 是否设立数据安全管理机构，明确内部数据处理关键岗位、职责以及任职要求，负责履行数据安全管理义务。", "method": "测试需求| 1. 数据安全管理机构设置文件。 2. 关键岗位职责说明。 | | 执行步骤 | 1. 查阅数据安全管理机构设置文件，确认是否设立。 2. 查阅关键岗位职责说明，确认是否明确关键岗位、职责和任职要求，并负责履行数据安全管理义务。 | | 预期结果 | 1. 已设立数据安全管理机构，明确关键岗位、职责和任职要求。 "}
{"id": "7.3.1.3.b", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.3 参与人员和获取方管理", "content": "7.3.1.3.b 是否对数据处理关键岗位从业人员进行数据安全相关培训和考核，确保其有相应的数据安全保护专业知识和技能，能够全面了解掌握数据安全政策法规有关要求；能够合理正确使用、配置组织配备的重要数据安全防护技术工具。", "method": "测试需求| 1. 培训计划和记录。 2. 考核记录。 | | 执行步骤 | 1. 查阅培训计划和记录，确认是否对数据处理关键岗位从业人员进行数据安全相关培训。 2. 查阅考核记录，确认是否考核其数据安全保护专业知识和技能，以及对政策法规和技术工具的了解掌握情况。 | | 预期结果 | 1. 已对数据处理关键岗位从业人员进行数据安全相关培训和考核，具备相应知识和技能。 "}
{"id": "7.3.1.3.c", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.3 参与人员和获取方管理", "content": "7.3.1.3.c 是否与数据处理关键岗位从业人员签订署数据安全责任书，责任书内容包括但不限于数据安全岗位职责、义务、处罚措施、注意事项等内容。", "method": "测试需求| 1. 数据安全责任书。 | | 执行步骤 | 1. 查阅数据安全责任书，确认是否与数据处理关键岗位从业人员签订。 2. 确认责任书内容是否包括岗位职责、义务、处罚措施、注意事项等内容。 | | 预期结果 | 1. 已与数据处理关键岗位从业人员签订数据安全责任书，内容完整。 "}
{"id": "7.3.1.3.d", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.3 参与人员和获取方管理", "content": "7.3.1.3.d 数据处理关键岗位人员权限是否进行区分，是否通过有效手段限制不同身份数据处理者权限。", "method": "测试需求| 1. 权限分配表。 2. 权限管理系统配置。 | | 执行步骤 | 1. 查阅权限分配表，确认数据处理关键岗位人员权限是否进行区分。 2. 查阅权限管理系统配置，确认是否通过有效手段限制不同身份数据处理者权限。 | | 预期结果 | 1. 数据处理关键岗位人员权限已区分，并有效限制不同身份数据处理者权限。 "}
{"id": "7.3.1.3.e", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.3 参与人员和获取方管理", "content": "7.3.1.3.e 是否建立数据获取方管理制度，形成获取方管理台账，加强对获取方数据使用情况的监督管理。", "method": "测试需求| 1. 数据获取方管理制度。 2. 获取方管理台账。 3. 监督管理记录。 | | 执行步骤 | 1. 查阅数据获取方管理制度和获取方管理台账，确认是否建立。 2. 查阅监督管理记录，确认是否加强对获取方数据使用情况的监督管理。 | | 预期结果 | 1. 已建立数据获取方管理制度和台账，并加强监督管理。 "}
{"id": "7.3.1.3.f", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.3 参与人员和获取方管理", "content": "7.3.1.3.f 是否与涉及处理重要数据、核心数据的获取方签署数据安全保护合同或协议，明确获取处理使用重要数据的目的、方式、范围、留存期限、超期处理的方式、再转移限制、安全保障措施以及相应的责任义务。", "method": "测试需求| 1. 数据安全保护合同或协议。 | | 执行步骤 | 1. 查阅数据安全保护合同或协议，确认是否与涉及处理重要数据、核心数据的获取方签署。 2. 确认协议内容是否明确获取处理使用重要数据的目的、方式、范围、留存期限、超期处理的方式、再转移限制、安全保障措施以及相应的责任义务。 | | 预期结果 | 1. 已与涉及处理重要数据、核心数据的获取方签署数据安全保护合同或协议，内容明确。 "}
{"id": "7.3.1.3.g", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.3 参与人员和获取方管理", "content": "7.3.1.3.g 是否对重要数据、核心数据获取方数据安全保护能力进行核验，确保其采取有效的安全措施保障重要数据、核心数据安全。", "method": "测试需求| 1. 获取方数据安全保护能力核验记录。 | | 执行步骤 | 1. 查阅获取方数据安全保护能力核验记录，确认是否对重要数据、核心数据获取方的数据安全保护能力进行核验。 2. 确认是否确保其采取有效的安全措施保障重要数据、核心数据安全。 | | 预期结果 | 1. 已对重要数据、核心数据获取方的数据安全保护能力进行核验，并确保其采取有效安全措施。 "}
{"id": "7.3.1.4.a", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.4 安全态势", "content": "7.3.1.4.a 重要数据、核心数据处理者是否曾发生过数据安全事件。", "method": "测试需求| 1. 数据安全事件记录。 | | 执行步骤 | 1. 查阅数据安全事件记录，确认重要数据、核心数据处理者是否曾发生过数据安全事件。 | | 预期结果 | 1. 未发生过数据安全事件或已发生并妥善处理。 "}
{"id": "7.3.1.4.b", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.4 安全态势", "content": "7.3.1.4.b 重要数据、核心数据处理者是否受到数据安全监管处罚。", "method": "测试需求| 1. 监管处罚记录。 | | 执行步骤 | 1. 查阅监管处罚记录，确认重要数据、核心数据处理者是否受到数据安全监管处罚。 | | 预期结果 | 1. 未受到数据安全监管处罚。 "}
{"id": "7.3.1.4.c", "condition": "required", "heading": "7.3 安全风险分析/7.3.1 风险源识别/7.3.1.4 安全态势", "content": "7.3.1.4.c 重要数据、核心数据处理者是否收到数据安全风险预警信息。", "method": "测试需求| 1. 数据安全风险预警信息记录。 | | 执行步骤 | 1. 查阅数据安全风险预警信息记录，确认重要数据、核心数据处理者是否收到数据安全风险预警信息。 | | 预期结果 | 1. 未收到或已及时处理数据安全风险预警信息。 "}